STMicroelectronics/stm32-wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_3
* Address       : 0X03
* Bit Group Name: LINEOUT1P_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_3_LINEOUT1P_ENA_MASK        (uint16_t)0x1000U
#define   WM8994_PWR_MGMT_3_LINEOUT1P_ENA_POSITION    12
int32_t   wm8994_pwr_mgmt_3_lineout1p_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_3
* Address       : 0X03
* Bit Group Name: LINEOUT1N_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_3_LINEOUT1N_ENA_MASK        (uint16_t)0x2000U
#define   WM8994_PWR_MGMT_3_LINEOUT1N_ENA_POSITION    13
int32_t   wm8994_pwr_mgmt_3_lineout1n_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: ADCR_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_ADCR_ENA_MASK        (uint16_t)0x0001U
#define   WM8994_PWR_MGMT_4_ADCR_ENA_POSITION    0
int32_t   wm8994_pwr_mgmt_4_adcr_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: ADCL_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_ADCL_ENA_MASK        (uint16_t)0x0002U
#define   WM8994_PWR_MGMT_4_ADCL_ENA_POSITION    1
int32_t   wm8994_pwr_mgmt_4_adcl_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: DMIC1R_ENA
* Permission    : RWZ
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_DMIC1R_ENA_MASK        (uint16_t)0x0004U
#define   WM8994_PWR_MGMT_4_DMIC1R_ENA_POSITION    2
int32_t   wm8994_pwr_mgmt_4_dmic1r_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: DMIC1L_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_DMIC1L_ENA_MASK        (uint16_t)0x0008U
#define   WM8994_PWR_MGMT_4_DMIC1L_ENA_POSITION    3
int32_t   wm8994_pwr_mgmt_4_dmic1l_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: DMIC2R_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_DMIC2R_ENA_MASK        (uint16_t)0x0010U
#define   WM8994_PWR_MGMT_4_DMIC2R_ENA_POSITION    4
int32_t   wm8994_pwr_mgmt_4_dmic2r_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: DMIC2L_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_DMIC2L_ENA_MASK        (uint16_t)0x0020U
#define   WM8994_PWR_MGMT_4_DMIC2L_ENA_POSITION    5
int32_t   wm8994_pwr_mgmt_4_dmic2l_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: AIF1ADC1R_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_AIF1ADC1R_ENA_MASK        (uint16_t)0x0100U
#define   WM8994_PWR_MGMT_4_AIF1ADC1R_ENA_POSITION    8
int32_t   wm8994_pwr_mgmt_4_aif1adc1r_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: AIF1ADC1L_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_AIF1ADC1L_ENA_MASK        (uint16_t)0x0200U
#define   WM8994_PWR_MGMT_4_AIF1ADC1L_ENA_POSITION    9
int32_t   wm8994_pwr_mgmt_4_aif1adc1l_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: AIF1ADC2R_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_AIF1ADC2R_ENA_MASK        (uint16_t)0x0400U
#define   WM8994_PWR_MGMT_4_AIF1ADC2R_ENA_POSITION    10
int32_t   wm8994_pwr_mgmt_4_aif1adc2r_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: AIF1ADC2L_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_AIF1ADC2L_ENA_MASK        (uint16_t)0x0800U
#define   WM8994_PWR_MGMT_4_AIF1ADC2L_ENA_POSITION    11
int32_t   wm8994_pwr_mgmt_4_aif1adc2l_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_PWR_MANAGEMENT_4
* Address       : 0X04
* Bit Group Name: AIF2ADCR_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_PWR_MGMT_4_AIF2ADCR_ENA_MASK        (uint16_t)0x1000U
#define   WM8994_PWR_MGMT_4_AIF2ADCR_ENA_POSITION    12
int32_t   wm8994_pwr_mgmt_4_aif2adcr_ena(wm8994_ctx_t *ctx, uint16_t value);

