STMicroelectronics/stm32-wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_ANTIPOP2
* Address       : 0X39
* Bit Group Name: VMID_BUF_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_ANTIPOP2_VMID_BUF_ENA_MASK          (uint16_t)0x0008
#define   WM8994_ANTIPOP2_VMID_BUF_ENA_POSITION      3
int32_t   wm8994_antipop2_vmid_buf_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_ANTIPOP2
* Address       : 0X39
* Bit Group Name: VMID_RAMP[1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_ANTIPOP2_VMID_RAMP_MASK          (uint16_t)0x0060
#define   WM8994_ANTIPOP2_VMID_RAMP_POSITION      5
int32_t   wm8994_antipop2_vmid_ramp(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_ANTIPOP2
* Address       : 0X39
* Bit Group Name: MICB1_DISCH
* Permission    : RW
*******************************************************************************/
#define   WM8994_ANTIPOP2_MICB1_DISCH_MASK          (uint16_t)0x0080
#define   WM8994_ANTIPOP2_MICB1_DISCH_POSITION      7
int32_t   wm8994_antipop2_micb1_disch(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_ANTIPOP2
* Address       : 0X39
* Bit Group Name: MICB2_DISCH
* Permission    : RW
*******************************************************************************/
#define   WM8994_ANTIPOP2_MICB2_DISCH_MASK          (uint16_t)0x0100
#define   WM8994_ANTIPOP2_MICB2_DISCH_POSITION      8
int32_t   wm8994_antipop2_micb2_disch(wm8994_ctx_t *ctx, uint16_t value);


/*******************************************************************************
* Register      : WM8994_CHARGE_PUMP1
* Address       : 0X4C
* Bit Group Name: CP_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_CHARGE_PUMP1_CP_ENA_MASK          (uint16_t)0x8000
#define   WM8994_CHARGE_PUMP1_CP_ENA_POSITION      15
int32_t   wm8994_charge_pump1_cp_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CHARGE_PUMP2
* Address       : 0X4D
* Bit Group Name: CP_DISCH
* Permission    : RW
*******************************************************************************/
#define   WM8994_CHARGE_PUMP2_CP_DISCH_MASK          (uint16_t)0x8000
#define   WM8994_CHARGE_PUMP2_CP_DISCH_POSITION      15
int32_t   wm8994_charge_pump2_cp_disch(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLASS_W
* Address       : 0X51
* Bit Group Name: CP_DYN_PWR
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLASS_W_CP_DYN_PWR_MASK          (uint16_t)0x0001
#define   WM8994_CLASS_W_CP_DYN_PWR_POSITION      0
int32_t   wm8994_class_w_cp_dyn_pwr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLASS_W
* Address       : 0X51
* Bit Group Name: CP_DYN_SRC_SEL [1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLASS_W_CP_DYN_SRC_SEL_MASK          (uint16_t)0x0300
#define   WM8994_CLASS_W_CP_DYN_SRC_SEL_POSITION      8
int32_t   wm8994_class_w_cp_dyn_src_sel(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DC_SERVO1
* Address       : 0X54
* Bit Group Name: DCS_ENA_CHAN_0
* Permission    : RW
*******************************************************************************/
#define   WM8994_DC_SERVO1_DCS_ENA_CHAN_0_MASK          (uint16_t)0x0001
#define   WM8994_DC_SERVO1_DCS_ENA_CHAN_0_POSITION      0
int32_t   wm8994_dc_servo1_dcs_ena_chan_0(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DC_SERVO1
* Address       : 0X54
* Bit Group Name: DCS_ENA_CHAN_1
* Permission    : RW
*******************************************************************************/
#define   WM8994_DC_SERVO1_DCS_ENA_CHAN_1_MASK          (uint16_t)0x0002
#define   WM8994_DC_SERVO1_DCS_ENA_CHAN_1_POSITION      1
int32_t   wm8994_dc_servo1_dcs_ena_chan_1(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DC_SERVO1
* Address       : 0X54
* Bit Group Name: DCS_TRIG_DAC_WR_0
* Permission    : RW
*******************************************************************************/
#define   WM8994_DC_SERVO1_DCS_TRIG_DAC_WR_0_MASK          (uint16_t)0x0004
#define   WM8994_DC_SERVO1_DCS_TRIG_DAC_WR_0_POSITION      2
int32_t   wm8994_dc_servo1_dcs_trig_dac_wr_0(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DC_SERVO1
* Address       : 0X54
* Bit Group Name: DCS_TRIG_DAC_WR_1
* Permission    : RW
*******************************************************************************/
#define   WM8994_DC_SERVO1_DCS_TRIG_DAC_WR_1_MASK          (uint16_t)0x0008
#define   WM8994_DC_SERVO1_DCS_TRIG_DAC_WR_1_POSITION      3
int32_t   wm8994_dc_servo1_dcs_trig_dac_wr_1(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_DC_SERVO1
* Address       : 0X54
* Bit Group Name: DCS_TRIG_STARTUP_0
* Permission    : RW
*******************************************************************************/
#define   WM8994_DC_SERVO1_DCS_TRIG_STARTUP_0_MASK          (uint16_t)0x0010
#define   WM8994_DC_SERVO1_DCS_TRIG_STARTUP_0_POSITION      4
int32_t   wm8994_dc_servo1_dcs_trig_startup_0(wm8994_ctx_t *ctx, uint16_t value);

