STMicroelectronics/stm32-wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_WRITE_SEQ_CTRL1
* Address       : 0X110
* Bit Group Name: WSEQ_START
* Permission    : RW
*******************************************************************************/
#define   WM8994_WSEQ_CTRL1_START_MASK                 (uint16_t)0x0100
#define   WM8994_WSEQ_CTRL1_START_POSITION             8
int32_t   wm8994_wseq_ctrl1_start(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_WRITE_SEQ_CTRL1
* Address       : 0X110
* Bit Group Name: WSEQ_ABORT
* Permission    : RW
*******************************************************************************/
#define   WM8994_WSEQ_CTRL1_ABORT_MASK                 (uint16_t)0x0200
#define   WM8994_WSEQ_CTRL1_ABORT_POSITION             9
int32_t   wm8994_wseq_ctrl1_abort(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_WRITE_SEQ_CTRL1
* Address       : 0X110
* Bit Group Name: WSEQ_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_WSEQ_CTRL1_ENA_MASK                 (uint16_t)0x8000
#define   WM8994_WSEQ_CTRL1_ENA_POSITION             15
int32_t   wm8994_wseq_ctrl1_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_CLOCKING1
* Address       : 0X200
* Bit Group Name: AIF1CLK_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CLOCKING1_ENA_MASK                 (uint16_t)0x0001
#define   WM8994_AIF1_CLOCKING1_ENA_POSITION             0
int32_t   wm8994_aif1_clocking1_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_CLOCKING1
* Address       : 0X200
* Bit Group Name: AIF1CLK_DIV
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CLOCKING1_DIV_MASK                 (uint16_t)0x0002
#define   WM8994_AIF1_CLOCKING1_DIV_POSITION             1
int32_t   wm8994_aif1_clocking1_div(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_CLOCKING1
* Address       : 0X200
* Bit Group Name: AIF1CLK_INV
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CLOCKING1_INV_MASK                 (uint16_t)0x0004
#define   WM8994_AIF1_CLOCKING1_INV_POSITION             2
int32_t   wm8994_aif1_clocking1_inv(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_CLOCKING1
* Address       : 0X200
* Bit Group Name: AIF1CLK_SRC [1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_CLOCKING1_SRC_MASK                 (uint16_t)0x0018U
#define   WM8994_AIF1_CLOCKING1_SRC_POSITION             3
int32_t   wm8994_aif1_clocking1_src(wm8994_ctx_t *ctx, uint16_t value);

/* Note: Registers (uint16_t)0x201, (uint16_t)0x204 and (uint16_t)0x205 are not implemented here */

/*******************************************************************************
* Register      : WM8994_CLOCKING1
* Address       : 0X208
* Bit Group Name: SYSCLK_SRC
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING1_SYSCLK_SRC_MASK                 (uint16_t)0x0001
#define   WM8994_CLOCKING1_SYSCLK_SRC_POSITION             0
int32_t   wm8994_clocking1_sysclk_src(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING1
* Address       : 0X208
* Bit Group Name: SYSDSPCLK_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING1_SYSDSPCLK_ENA_MASK                 (uint16_t)0x0002
#define   WM8994_CLOCKING1_SYSDSPCLK_ENA_POSITION             1
int32_t   wm8994_clocking1_sysdspclk_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING1
* Address       : 0X208
* Bit Group Name: AIF2DSPCLK_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING1_AIF2DSPCLK_ENA_MASK                 (uint16_t)0x0004
#define   WM8994_CLOCKING1_AIF2DSPCLK_ENA_POSITION             2
int32_t   wm8994_clocking1_aif2dspclk_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING1
* Address       : 0X208
* Bit Group Name: AIF1DSPCLK_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING1_AIF1DSPCLK_ENA_MASK                 (uint16_t)0x0008
#define   WM8994_CLOCKING1_AIF1DSPCLK_ENA_POSITION             3
int32_t   wm8994_clocking1_aif1dspclk_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING1
* Address       : 0X208
* Bit Group Name: TOCLK_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING1_TOCLK_ENA_MASK                 (uint16_t)0x0010
#define   WM8994_CLOCKING1_TOCLK_ENA_POSITION             4
int32_t   wm8994_clocking1_toclk_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_CLOCKING2
* Address       : 0X209
* Bit Group Name: OPCLK_DIV[2:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_CLOCKING2_OPCLK_DIV_MASK                 (uint16_t)0x0007
#define   WM8994_CLOCKING2_OPCLK_DIV_POSITION             0
int32_t   wm8994_clocking2_opclk_div(wm8994_ctx_t *ctx, uint16_t value);

