STMicroelectronics/stm32-wm8994/wm8994_reg.h
/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_FILTER1
* Address       : 0X422
* Bit Group Name: AIF1DAC1_DEEMP [1:0]
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_FILTER1_DEEMP_MASK                 (uint16_t)0x0006
#define   WM8994_AIF1_DAC2_FILTER1_DEEMP_POSITION             1
int32_t   wm8994_aif1_dac2_filter1_deemp(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_FILTER1
* Address       : 0X422
* Bit Group Name: AIF1DAC1_UNMUTE_RAMP
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_FILTER1_UNMUTE_RAMP_MASK                 (uint16_t)0x0010
#define   WM8994_AIF1_DAC2_FILTER1_UNMUTE_RAMP_POSITION             4
int32_t   wm8994_aif1_dac2_filter1_unmute_ramp(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_FILTER1
* Address       : 0X422
* Bit Group Name: AIF1DAC1_MUTERATE
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_FILTER1_MUTERATE_MASK                 (uint16_t)0x0020
#define   WM8994_AIF1_DAC2_FILTER1_MUTERATE_POSITION             5
int32_t   wm8994_aif1_dac2_filter1_muterate(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_FILTER1
* Address       : 0X422
* Bit Group Name: AIF1DAC1_MONO
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_FILTER1_MONO_MASK                 (uint16_t)0x0080
#define   WM8994_AIF1_DAC2_FILTER1_MONO_POSITION             7
int32_t   wm8994_aif1_dac2_filter1_mono(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DAC1_FILTER1
* Address       : 0X422
* Bit Group Name: AIF1DAC1_MUTE
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1_DAC2_FILTER1_MUTE_MASK                 (uint16_t)0x0200
#define   WM8994_AIF1_DAC2_FILTER1_MUTE_POSITION             9
int32_t   wm8994_aif1_dac2_filter1_mute(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1ADC1R_DRC_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_ADC1R_DRC_ENA_MASK                 (uint16_t)0x0001
#define   WM8994_AIF1DRC1_ADC1R_DRC_ENA_POSITION             0
int32_t   wm8994_aif1drc1_adc1r_drc_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1ADC1L_DRC_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_ADC1L_DRC_ENA_MASK                 (uint16_t)0x0002
#define   WM8994_AIF1DRC1_ADC1L_DRC_ENA_POSITION             1
int32_t   wm8994_aif1drc1_adc1l_drc_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DAC1_DRC_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_DAC1_DRC_ENA_MASK                 (uint16_t)0x0004
#define   WM8994_AIF1DRC1_DAC1_DRC_ENA_POSITION             2
int32_t   wm8994_aif1drc1_dac1_drc_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_ANTICLIP
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_ANTICLIP_MASK                 (uint16_t)0x0008
#define   WM8994_AIF1DRC1_ANTICLIP_POSITION             3
int32_t   wm8994_aif1drc1_anticlip(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_QR
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_QR_MASK                 (uint16_t)0x0010
#define   WM8994_AIF1DRC1_QR_POSITION             4
int32_t   wm8994_aif1drc1_qr(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_KNEE2_OP_ENA
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_KNEE2_OP_ENA_MASK                 (uint16_t)0x0020
#define   WM8994_AIF1DRC1_KNEE2_OP_ENA_POSITION             5
int32_t   wm8994_aif1drc1_knee2_op_ena(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_SIG_DET
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_SIG_DET_MASK                 (uint16_t)0x0040
#define   WM8994_AIF1DRC1_SIG_DET_POSITION             6
int32_t   wm8994_aif1drc1_sig_det(wm8994_ctx_t *ctx, uint16_t value);

/*******************************************************************************
* Register      : WM8994_AIF1_DRC1
* Address       : 0X440
* Bit Group Name: AIF1DRC1_SIG_DET_MODE
* Permission    : RW
*******************************************************************************/
#define   WM8994_AIF1DRC1_SIG_DET_MODE_MASK                 (uint16_t)0x0080
#define   WM8994_AIF1DRC1_SIG_DET_MODE_POSITION             7
int32_t   wm8994_aif1drc1_sig_det_mode(wm8994_ctx_t *ctx, uint16_t value);

